New customers: Count of users who registered in that month

In [2]:
from src import SQL_Executor, SQL_Queries

executor = SQL_Executor()
query = SQL_Queries.Portfolio()

In [2]:
executor.display_results(executor.execute_query(query.new_customers()))

    user_count    month
0          982  2023-12
1          441  2024-01
2          442  2024-02
3          634  2024-03
4          637  2024-04
5          639  2024-05
6          641  2024-06
7          644  2024-07
8          904  2024-08
9          908  2024-09
10         650  2024-10
11        1175  2024-11

In [3]:
executor.display_results(executor.execute_query(query.active_customers()))

    user_count    month
0          838  2023-12
1          379  2024-01
2          381  2024-02
3          531  2024-03
4          533  2024-04
5          539  2024-05
6          545  2024-06
7          536  2024-07
8          773  2024-08
9          749  2024-09
10         564  2024-10
11         999  2024-11

In [4]:
executor.display_results(executor.execute_query(query.transaction_volume()))

    transaction_count  transaction_amount    month
0                 817           390514.66  2023-12
1                 665           245103.96  2024-01
2                 605           194921.17  2024-02
3                1597           688981.42  2024-03
4                1591           785213.08  2024-04
5                1488           607347.83  2024-05
6                1174           418896.70  2024-06
7                1348           643379.65  2024-07
8                2595          1142019.75  2024-08
9                2879          1392094.44  2024-09
10               2180           956599.28  2024-10
11               6003          2372425.70  2024-11
12                  5             5467.21  2024-12

In [3]:
executor.display_results(executor.execute_query(query.installment_plans()))

    installment_number       total
0                    1  3573658.90
1                    2  3573658.90
2                    3  3573658.90
3                    4  3573675.76
4                    5  1139070.65
5                    6  1139072.01
6                    7   261847.17
7                    8   261847.17
8                    9   261847.17
9                   10   261847.17
10                  11   261847.17
11                  12   261845.06
12                  13    30996.95
13                  14    30996.95
14                  15    30996.95
15                  16    30996.95
16                  17    30996.95
17                  18    30996.95
18                  19    30996.95
19                  20    30996.95
20                  21    30996.95
21                  22    30996.95
22                  23    30996.95
23                  24    30994.79

In [6]:
executor.display_results(executor.execute_query(query.popular_categories()))

      category  transaction_count
0  electronics              11755
1      fashion               9486
2         home               9136
3       sports               6205
4       beauty               5774
5       others               2267